spec/cassettes/Create_payment_on_successful_charge/creates_a_payment_with_the_webhook_from_stripe_for_charge_succeeded.yml

---
http_interactions:
- request:
    method: get
    uri: https://api.stripe.com/v1/events/evt_2PLkpdRwuM0vMf
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - ! '*/*; q=0.5, application/xml'
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.8.3
      Authorization:
      - Bearer sk_test_OJz03Gsmewauak1Y2dSEuUtJ
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - ! '{"bindings_version":"1.8.3","lang":"ruby","lang_version":"1.9.3 p194 (2012-04-20)","platform":"x86_64-darwin12.3.0","publisher":"stripe","uname":"Darwin
        Hagios-MacBook-Pro.local 12.4.0 Darwin Kernel Version 12.4.0: Wed May  1 17:57:12
        PDT 2013; root:xnu-2050.24.15~1/RELEASE_X86_64 x86_64"}'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Sun, 18 Aug 2013 14:29:39 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '1562'
      Connection:
      - keep-alive
      Access-Control-Max-Age:
      - '300'
      Access-Control-Allow-Credentials:
      - 'true'
      Cache-Control:
      - no-cache, no-store
    body:
      encoding: US-ASCII
      string: ! "{\n  \"id\": \"evt_2PLkpdRwuM0vMf\",\n  \"created\": 1376835662,\n
        \ \"livemode\": false,\n  \"type\": \"charge.succeeded\",\n  \"data\": {\n
        \   \"object\": {\n      \"id\": \"ch_2PLkv8nabIxsls\",\n      \"object\":
        \"charge\",\n      \"created\": 1376835661,\n      \"livemode\": false,\n
        \     \"paid\": true,\n      \"amount\": 999,\n      \"currency\": \"cad\",\n
        \     \"refunded\": false,\n      \"card\": {\n        \"id\": \"card_2PLk9ZXxOGZbgl\",\n
        \       \"object\": \"card\",\n        \"last4\": \"4242\",\n        \"type\":
        \"Visa\",\n        \"exp_month\": 12,\n        \"exp_year\": 2013,\n        \"fingerprint\":
        \"dYM8NQQzCkhwHw6j\",\n        \"customer\": \"cus_2PLkxka84SmZZI\",\n        \"country\":
        \"US\",\n        \"name\": null,\n        \"address_line1\": null,\n        \"address_line2\":
        null,\n        \"address_city\": null,\n        \"address_state\": null,\n
        \       \"address_zip\": null,\n        \"address_country\": null,\n        \"cvc_check\":
        \"pass\",\n        \"address_line1_check\": null,\n        \"address_zip_check\":
        null\n      },\n      \"captured\": true,\n      \"balance_transaction\":
        \"txn_2PLkVPLFlGxA2w\",\n      \"failure_message\": null,\n      \"failure_code\":
        null,\n      \"amount_refunded\": 0,\n      \"customer\": \"cus_2PLkxka84SmZZI\",\n
        \     \"invoice\": \"in_2PLkwP3PfiiMNa\",\n      \"description\": null,\n
        \     \"dispute\": null,\n      \"fee\": 59,\n      \"fee_details\": [\n        {\n
        \         \"amount\": 59,\n          \"currency\": \"cad\",\n          \"type\":
        \"stripe_fee\",\n          \"description\": \"Stripe processing fees\",\n
        \         \"application\": null\n        }\n      ]\n    }\n  },\n  \"object\":
        \"event\",\n  \"pending_webhooks\": 0,\n  \"request\": \"iar_2PLkIyIK1SSiW7\"\n}\n"
    http_version: 
  recorded_at: Sun, 18 Aug 2013 14:29:39 GMT
recorded_with: VCR 2.5.0
